Revit 2026 API

# DimensionSegment Class

---

A segment of a dimension within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDimensionSegment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DimensionSegment : APIObject
```
```vb
Public Class DimensionSegment
	Inherits APIObject
```
```cpp
public ref class DimensionSegment : public APIObject
```
```fsharp
type DimensionSegment =
    class
        inherit APIObject
    end
```

The DimensionSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Above | The text shown above the segment's value. |
|  | Below | The text shown below the segment's value. |
|  | IsLocked | Indicates if this segment is locked. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | LeaderEndPosition | The position of the dimension leader end point. |
|  | Origin | The segment origin. |
|  | Prefix | The text shown before the segment's value. |
|  | Suffix | The text shown after the segment's value. |
|  | TextPosition | The position of the dimension text's drag point. |
|  | Value | The length of the segment. |
|  | ValueOverride | The text that replaces the segment's value. |
|  | ValueString | The displayed value shown for the dimension segment. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition. |
|  | ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace